Create PO.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.5">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="API MongoBD" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
        <collectionProp name="HeaderManager.headers">
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Content-Type</stringProp>
            <stringProp name="Header.value">application/json</stringProp>
          </elementProp>
          <elementProp name="" elementType="Header">
            <stringProp name="Header.name">Authorization</stringProp>
            <stringProp name="Header.value">Bearer eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJ1c2VyX2lkIjoxLCJwZXJtaXNzaW9ucyI6WyJ1c3JfbWdtdCIsImR2cyIsImR2c19yZGwiLCJkdnNfcmRkIiwiZHZzX2NydCIsImR2c191cGQiLCJkdnNfYXJjIiwicG1zIiwicG1zX3JkbCIsInJvbCIsInJvbF9yZGwiLCJyb2xfcmRkIiwicm9sX2NydCIsInJvbF91cGQiLCJyb2xfYXJjIiwicm9sX3VyYyIsInVzciIsInVzcl9yZGwiLCJ1c3JfcmRkIiwidXNyX2NydCIsInVzcl91cGQiLCJ1c3JfcnN0X3Bhc3MiLCJ1c3JfYXJjIiwidXNyX3VyYyIsImNmZyIsImFwcCIsImFwcF9yZGwiLCJhcHBfdXBkIiwiYXBwX2NydCIsInJnbl9wbGMiLCJyZ3BfcmRsIiwidXNyX3ByZiIsInJncF91cGQiLCJ1c3JfcHJmX3VwZCIsInVzcl9yc3RfcGFzcyIsImR5byIsImR5b19yZGwiLCJkeW9fdXBkIiwiZHlvX2FyYyIsImR5b191cmMiLCJ3cnQiLCJ3cnRfcmRsIiwid3J0X3JkZCIsIndydF91cGQiLCJjdGwiLCJpdG0iLCJpdG1fcmRsIiwiaXRtX3JkZCIsIml0bV91cGxfaW1nIiwiaXRtX3VwZF9wa2IiLCJpdG1fdXBkX2ZyZyIsIml0bV91cGQiLCJpdG1fY3RnIiwiaXRtX2N0Z19yZGwiLCJpdG1fY3RnX3JkZCIsIml0bV9jdGdfdXBsX2ltZyIsIml0bV9jdGdfY3J0IiwiaXRtX2N0Z191cGQiLCJpdG1fY3RnX2FyYyIsIml0bV9jdGdfdXJjIiwiaG9tZSIsImNtcCIsImJuciIsImJucl9yZGwiLCJibnJfcmRkIiwiYm5yX2NydCIsImJucl9hcmMiLCJpc2MiLCJpc2NfcmRsIiwiaXNjX3JkZCIsImlzY19jcnQiLCJpc2NfdXBkIiwiaXNjX2FyYyIsInBudCIsInBudF9jcnQiLCJwbnRfdXBkIiwicG50X3JkbCIsInBudF9yZGQiLCJwbnRfY2FuIiwiY3N0X3JsdCIsImNhIiwiY2FfcmRsIiwiY2FfcmRkIiwic2xhIiwic2xhX2V4cCIsInNsYV91cGwiLCJzbGFfcmRsIiwic2xhX3JkZCIsInNsYV9jYW5fYnRjIiwic2xhX2Nhbl9pdG0iLCJzbGFfb2JqX2NydCIsInNsYV9vYmpfdXBkIiwic2xhX29ial9yZGwiLCJzbGFfb2JqX3JkZCIsInNsYV9vYmpfYXJjIiwic2xhX29ial91cmMiLCJzbGFfc3ViIiwic2xhX3N1Yl9yZGwiLCJzbGFfc3ViX3JkZCIsInNscCIsInNscF9yZGwiLCJzbHBfcmRkIiwicHJvX2NzdCIsInByb19jc3RfcmRsIiwicHJvX2NzdF9yZGQiLCJwcm9fY3N0X3JlZyIsInByb19jc3RfZGVjIiwicHJvX2NzdF91cGciLCJwcm9fY3N0X2V4cCIsImNzdCIsImNzdF9yZGwiLCJjc3RfcmRkIiwiY3N0X3VwZCIsImNzdF9hcmMiLCJjc3RfdXJjIiwic3RlIiwicGMiLCJwY19jcnQiLCJwY19yZGwiLCJwY19yZGQiLCJwY19wcnQiLCJwY19kZWwiLCJwY191cGQiLCJwY19leHAiLCJwY19wa19yZGwiLCJsZ3MiLCJjdHJsX3R3ciIsImN0cmxfdHdyX3JkbCIsImN0cmxfdHdyX3JkZCIsImN0cmxfdHdyX2NhbiIsInBybSIsInZvdSIsInZvdV9jcnQiLCJ2b3VfYXJjIiwidm91X3JkbCIsInZvdV9yZGQiLCJ2b3VfYmxrX2ltcCJdLCJleHBpcmVfYXQiOjE2Nzg3ODQ5MDYsInRpbWV6b25lIjoiQXNpYS9KYWthcnRhIn0.8k8DnSNMks3Ll2hCchig26QptBx1NaPWV2fWGyQ0xm4</stringProp>
          </elementProp>
        </collectionProp>
      </HeaderManager>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">1</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">1000</stringProp>
        <stringProp name="ThreadGroup.ramp_time">20</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Create PO" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;delivery_date&quot;: &quot;2023-03-17&quot;,&#xd;
    &quot;site_id&quot;: 1,&#xd;
    &quot;region_id&quot;: 65536,&#xd;
    &quot;note&quot;: &quot;test banyak&quot;&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">gateway.edenfarm.tech</stringProp>
          <stringProp name="HTTPSampler.port">443</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/site/v1/packing_order</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Print  PO" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
    &quot;pack_type&quot;: 0.25,&#xd;
    &quot;item_id&quot;: 1,&#xd;
    &quot;type_print&quot;: 1,&#xd;
    &quot;weight_scale&quot;: 217&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.domain">gateway.edenfarm.tech</stringProp>
          <stringProp name="HTTPSampler.port">443</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/site/v1/packing_order/pack/print/109</stringProp>
          <stringProp name="HTTPSampler.method">PUT</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
          <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
            <boolProp name="ResultCollector.error_logging">false</boolProp>
          </ResultCollector>
          <hashTree/>
        </hashTree>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>